app/views/stories/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
            <% if current_user
                user = User.find_by_id(session[:user_id])