app/controllers/comments_controller.rb

  def create
    if !current_user then
      redirect_to new_session_path, notice: 'You must be logged in to add a comment'
    else
    @comment= @commentable.comments.new comment_params
    @comment.save
---
INSERT INTO "comments" ("username", "text", "created_at", "updated_at", "commentable_type", "commentable_id", "story_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def find_comment_parent
    @commentable = Comment.find_by_id(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def find_commentable

    @commentable= Comment.find_by_id(params[:comment_id]) if params[:comment_id]
    @commentable = Story.find_by_id(params[:story_id]) if params[:story_id]
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]