app/controllers/stories_controller.rb

    def create
        @story = Story.new(story_params)

        if @story.save
---
INSERT INTO "stories" ("text", "title", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def upvote
        @story_upvote = Story.find(params[:id])
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]